# Ответы на сообщения
start_ans = 'Привет! Я FormulaNow — твой бот по Формуле 1. Я расскажу тебе, когда будет следующая гонка, кто лидирует в чемпионате и многое другое. Вот что я умею:'
next_race_ans = 'Здесь будет информация о следующей гонке'
schedule_ans = 'Здесь будет расписание'
track_ans = 'Здесь будет информация о треке'
standings_ans = 'Тут будет личный зечет'
teams_ans = 'Здесь будет кубок конструкторов'

# Текста кнопок
next_race_button_text = 'Следующая гонка'
schedule_button_text = 'Расписание заездов'
track_button_text = 'Трасса'
standings_button_text = 'Личный зечет'
teams_button_text = 'Кубок конструкторов'
